app/Controllers/Produtos.php

    public function ListarTabela()
    {
        $data = $this->produtosModel->findAll();
---
SELECT *
FROM `produtos`

    public function getRegistros($limit)
    {
        $data = $this->produtosModel->findAll($limit);
---
SELECT *
FROM `produtos`
 LIMIT 5

    public function inscreverProduto(){
        $this->produtosModel->save([
            'nome'  => $this->request->getPost('nome'),
            'valor' => $this->request->getPost('valor'),
            'descricao' => $this->request->getPost('descricao')
        ]);
---
INSERT INTO `produtos` (`nome`, `valor`, `descricao`) VALUES ('Headphone ThinkC', '459.00', 'Liberado. Novo.')

    public function atualizar($id){
        $data = $this->request->getJson();
        $this->produtosModel->update($id, $data);
---
UPDATE `produtos` SET `nome` = 'Tablet Insomnia SJ3', `valor` = '2599.00', `descricao` = 'Liberado. Novo.'
WHERE `produtos`.`id` IN ('3')

    public function deletar($id){
        $this->produtosModel->delete($id);
---
DELETE FROM `produtos`
WHERE `id` IN ('6')