app/Models/ProdutosModel.php

    public function getProduto($id){
        return $this->asArray()->where(["id"=>$id])->first();
---
SELECT *
FROM `produtos`
WHERE `id` = '1'
 LIMIT 1